tests/fixtures/struct-request.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/">
  <SOAP-ENV:Body>
    <ns1:summarize xmlns:ns1="urn:calculator">
      <payload>
        <name xsi:type="xsd:string">Ada</name>
        <active xsi:type="xsd:boolean">true</active>
        <scores SOAP-ENC:arrayType="xsd:int[3]">
          <item xsi:type="xsd:int">1</item>
          <item xsi:type="xsd:int">2</item>
          <item xsi:type="xsd:int">3</item>
        </scores>
      </payload>
    </ns1:summarize>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
